app/controllers/address_books_controller.rb

SELECT "address_books".* FROM "address_books"
---
  def index
    #@address_books = AddressBook.all
     @address_books = AddressBook.all

INSERT INTO "address_books" ("name", "email", "telephone", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "deisy "], ["email", "deisy-84@gmail.com"], ["telephone", "3245677"], ["created_at", "2016-08-11 02:24:23.863169"], ["updated_at", "2016-08-11 02:24:23.863169"]]
---
  def create
    @address_book = AddressBook.new(address_book_params)

    respond_to do |format|
      if @address_book.save

DELETE FROM "address_books" WHERE "address_books"."id" = ?  [["id", 1]]
---
  def destroy
    @address_book.destroy

SELECT  "address_books".* FROM "address_books" WHERE "address_books"."id" = ? LIMIT 1  [["id", 25]]
---
    def set_address_book
      @address_book = AddressBook.find(params[:id])